GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_rtcounter.c
/****************************************************************************
 * arch/arm/src/gd32e11x/gd32e11x_rtcounter.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* The GD32 RTC Driver offers standard precision of 1 Hz or High Resolution
 * operating at rate up to 16384 Hz. It provides UTC time and alarm interface
 * with external output pin (for wake-up).
 *
 * RTC is based on hardware RTC module which is located in a separate power
 * domain. The 32-bit counter is extended by 16-bit registers in BKP domain
 * GD32 backup data register to provide system equivalent storage for time_t.
 * (time_t *).
 *
 * Notation:
 *  - clock refers to 32-bit hardware counter
 *  - time is a combination of clock and upper bits stored in backuped domain
 *    with unit of 1 [s]
 *
 * TODO:
 * Error Handling in case LSE fails during start-up or during operation.
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/timers/rtc.h>
#include <nuttx/spinlock.h>
#include <arch/board/board.h>

#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>
#include <time.h>

#include "arm_internal.h"
#include "chip.h"
#include "gd32e11x.h"
#include "gd32e11x_rtc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

/* In hi-res mode, the RTC operates at 16384Hz.  Overflow interrupts are
 * handled when the 32-bit RTC counter overflows every 3 days and 43 minutes.
 * A BKP register is incremented on each overflow interrupt creating,
 * effectively, a 48-bit RTC counter.
 *
 * In the lo-res mode, the RTC operates at 1Hz.  Overflow interrupts are not
 * handled (because the next overflow is not expected until the year 2106).
 *
 * WARNING:
 * Overflow interrupts are lost whenever the GD32 is powered down.  The
 * overflow interrupt may be lost even if the GD32 is powered down only
 * momentarily. Therefore hi-res solution is only useful in systems where
 * the power is always on.
 */

#ifdef CONFIG_RTC_HIRES
#  ifndef CONFIG_RTC_FREQUENCY
#    error "CONFIG_RTC_FREQUENCY is required for CONFIG_RTC_HIRES"
#  elif CONFIG_RTC_FREQUENCY != 16384
#    error "Only hi-res CONFIG_RTC_FREQUENCY of 16384Hz is supported"
#  endif
#else
#  ifndef CONFIG_RTC_FREQUENCY
#    define CONFIG_RTC_FREQUENCY 1
#  endif
#  if CONFIG_RTC_FREQUENCY != 1
#    error "Only lo-res CONFIG_RTC_FREQUENCY of 1Hz is supported"
#  endif
#endif

#ifndef CONFIG_GD32E11X_BKP
#  error "CONFIG_GD32E11X_BKP is required for CONFIG_GD32E11X_RTC"
#endif

#ifndef CONFIG_GD32E11X_PMU
#  error "CONFIG_GD32E11X_PMU is required for CONFIG_GD32E11X_RTC"
#endif

#if defined(CONFIG_GD32_RTC_HXTALCLOCK)
#  error "RTC with HXTAL clock not yet implemented for GD32E11x"
#elif defined(CONFIG_GD32_RTC_LSICLOCK)
#  error "RTC with LSI clock not yet implemented for GD32E11x"
#endif

/* RTC/BKP Definitions ******************************************************/

/* GD32_RTC_PRESCALAR_VALUE
 *   RTC pre-scalar value.  The RTC is driven by a 32,768Hz input clock.
 *   This input value is divided by this value (plus one) to generate the
 *   RTC frequency.
 * RTC_TIMEMSB_REG
 *   The BKP module register used to hold the RTC overflow value.
 *   Overflows are only handled in hi-res mode.
 * RTC_CLOCKS_SHIFT
 *   The shift used to convert the hi-res timer LSB to one second.
 *   Not used with the lo-res timer.
 */

#ifdef CONFIG_RTC_HIRES
#  define GD32_RTC_PRESCALER_VALUE  GD32_RTC_PRESCALER_MIN
#  define RTC_TIMEMSB_REG           GD32_BKP_DATA1
#  define RTC_CLOCKS_SHIFT          14
#else
#  define GD32_RTC_PRESCALER_VALUE GD32_RTC_PRESCALER_SECOND
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct rtc_regvals_s
{
  uint16_t cntl;
  uint16_t cnth;
#ifdef CONFIG_RTC_HIRES
  uint16_t ovf;
#endif
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static spinlock_t g_rtc_lock = SP_UNLOCKED;

/* Callback to use when the alarm expires */

#ifdef CONFIG_RTC_ALARM

static alarmcb_t g_alarmcb;

/* Cached alarm value — ALRMH/ALRML are write-only registers on
 * GD32E11x (STM32F1-compatible), reading them returns undefined data.
 * We cache the values here so that gd32_rtc_rdalarm() can return them.
 */

static uint16_t g_alarm_cnth;
static uint16_t g_alarm_cntl;
#endif

/****************************************************************************
 * Public Data
 ****************************************************************************/

/* Variable determines the state of the LSE oscillator.
 * Possible errors:
 *   - on start-up
 *   - during operation, reported by LSE interrupt
 */

volatile bool g_rtc_enabled = false;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static inline void gd32_rtc_bkp_write_enable(void)
{
  modifyreg32(GD32_RCU_APB1EN, 0, RCU_APB1EN_PMUEN | RCU_APB1EN_BKPIEN);
  modifyreg32(GD32_PMU_CTL, 0, PMU_CTL_BKPWEN);
}

static inline void gd32_rtc_bkp_write_disable(void)
{
  modifyreg32(GD32_PMU_CTL, PMU_CTL_BKPWEN, 0);
}

/****************************************************************************
 * Name: gd32_rtc_waitlasttask
 *
 * Description:
 *   wait task done
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

