GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_rtcounter.c
static inline void gd32_rtc_waitlasttask(void)
{
  /* Previous write is done? */

  while ((getreg32(GD32_RTC_CTL) & RTC_CTL_LWOFF) == 0)
    {
      gd32_waste();
    }
}

/****************************************************************************
 * Name: gd32_rtc_beginwr
 *
 * Description:
 *   Enter configuration mode
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void gd32_rtc_beginwr(void)
{
    gd32_rtc_waitlasttask();

  /* Enter Config mode, Set Value and Exit */

    modifyreg32(GD32_RTC_CTL, 0, RTC_CTL_CMF);
}

/****************************************************************************
 * Name: gd32_rtc_endwr
 *
 * Description:
 *   Exit configuration mode
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void gd32_rtc_endwr(void)
{
    modifyreg32(GD32_RTC_CTL, RTC_CTL_CMF, 0);
    gd32_rtc_waitlasttask();
}

/****************************************************************************
 * Name: gd32_rtc_wait4rsf
 *
 * Description:
 *   Wait for registers to synchronise with RTC module, call after power-up
 *   only
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void gd32_rtc_wait4rsf(void)
{
  modifyreg32(GD32_RTC_CTL, RTC_CTL_RSYNF, 0);

  while ((getreg32(GD32_RTC_CTL) & RTC_CTL_RSYNF) == 0)
    {
      gd32_waste();
    }
}

/****************************************************************************
 * Name: gd32_rtc_breakout
 *
 * Description:
 *   Set the RTC to the provided time.
 *
 * Input Parameters:
 *   tp - the time to use
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_HIRES
static void gd32_rtc_breakout(const struct timespec *tp,
                              struct rtc_regvals_s *regvals)
{
  uint64_t frac;
  uint32_t cnt;
  uint16_t ovf;

  /* Break up the time in seconds + milleconds into the correct values for
   * our use
   */

  frac = ((uint64_t)tp->tv_nsec * CONFIG_RTC_FREQUENCY) / 1000000000;
  cnt  = ((uint32_t)tp->tv_sec << RTC_CLOCKS_SHIFT) |
         ((uint32_t)frac & (CONFIG_RTC_FREQUENCY - 1));
  ovf  = (tp->tv_sec >> (32 - RTC_CLOCKS_SHIFT));

  /* Then return the broken out time */

  regvals->cnth = (uint16_t)(cnt >> 16);
  regvals->cntl = (uint16_t)(cnt & 0xffff);
  regvals->ovf  = ovf;
}
#else
static inline void gd32_rtc_breakout(const struct timespec *tp,
                                     struct rtc_regvals_s *regvals)
{
  /* The low-res timer is easy... tv_sec holds exactly the value needed
   * by the CNTH/CNTL registers.
   */

  regvals->cnth = (uint16_t)((uint32_t)tp->tv_sec >> 16);
  regvals->cntl = (uint16_t)((uint32_t)tp->tv_sec & 0xffff);
}
#endif

/****************************************************************************
 * Name: gd32_rtc_interrupt
 *
 * Description:
 *    RTC interrupt service routine
 *
 * Input Parameters:
 *   irq - The IRQ number that generated the interrupt
 *   context - Architecture specific register save information.
 *
 * Returned Value:
 *   Zero (OK) on success; A negated errno value on failure.
 *
 ****************************************************************************/

#if defined(CONFIG_RTC_HIRES) || defined(CONFIG_RTC_ALARM)
static int gd32_rtc_interrupt(int irq, void *context, void *arg)
{
  uint32_t source = getreg32(GD32_RTC_CTL);

#ifdef CONFIG_RTC_HIRES
  if ((source & RTC_CTL_OVIF) != 0)
    {
      gd32_rtc_bkp_write_enable();
      putreg32(getreg32(RTC_TIMEMSB_REG) + 1, RTC_TIMEMSB_REG);
      gd32_rtc_bkp_write_disable();
    }
#endif

#ifdef CONFIG_RTC_ALARM
  if ((source & RTC_CTL_ALRMIF) != 0 && g_alarmcb != NULL)
    {
      /* Alarm callback */

      g_alarmcb();
      g_alarmcb = NULL;
    }
#endif

  /* Clear pending flags, leave RSF high */

  putreg32(RTC_CTL_RSYNF, GD32_RTC_CTL);

#ifdef CONFIG_RTC_ALARM
  /* Clear the EXTI line 17 pending bit */

  putreg32(EXTI_RTC_ALARM, GD32_EXTI_PD);
#endif
  return 0;
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_rtc_initialize
 *
 * Description:
 *   Initialize the hardware RTC per the selected configuration.
 *   This function is called once during the OS initialization sequence
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

int up_rtc_initialize(void)
{
  uint32_t regval;

  /* Enable write access to the backup domain (RTC registers, RTC backup data
   * registers and backup SRAM).
   */

  gd32_rtc_bkp_write_enable();

  regval = getreg32(RTC_MAGIC_REG);
  if (regval != RTC_MAGIC && regval != RTC_MAGIC_TIME_SET)
    {
      /* Reset backup domain if bad magic */

      modifyreg32(GD32_RCU_BDCTL, 0, RCU_BDCTL_BKPRST);
      modifyreg32(GD32_RCU_BDCTL, RCU_BDCTL_BKPRST, 0);

      modifyreg32(GD32_RCU_BDCTL, 0, RCU_BDCTL_LXTALEN);

      /* Wait for the LSE clock to be ready */

      while ((getreg32(GD32_RCU_BDCTL) & RCU_BDCTL_LXTALSTB) == 0)
        {
          gd32_waste();
        }

      /* Select the lower power external 32,768Hz (Low-Speed External, LSE)
       * oscillator as RTC Clock Source and enable the Clock.
       */

      modifyreg32(GD32_RCU_BDCTL, RCU_BDCTL_RTCSRC_MASK,
                  RCU_BDCTL_RTCSRC_LXTAL);

      /* Enable RTC and wait for RSF */

      modifyreg32(GD32_RCU_BDCTL, 0, RCU_BDCTL_RTCEN);
      gd32_rtc_waitlasttask();

      gd32_rtc_wait4rsf();
      gd32_rtc_waitlasttask();

      /* Configure prescaler, note that these are write-only registers */

      gd32_rtc_beginwr();
      putreg32(GD32_RTC_PRESCALER_VALUE >> 16, GD32_RTC_PSCH);
      putreg32(GD32_RTC_PRESCALER_VALUE & 0xffff, GD32_RTC_PSCL);
      gd32_rtc_endwr();

