GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_rtcounter.c
      gd32_rtc_wait4rsf();
      gd32_rtc_waitlasttask();

      /* Write the magic register after RTC initialization. */

      putreg32(RTC_MAGIC, RTC_MAGIC_REG);
    }
  else
    {
      /* Warm restart: RTC already configured but APB1/RTC clock domains
       * are not yet synchronized after reset.  Must wait for RSF before
       * any RTC register reads are valid.
       */

      gd32_rtc_wait4rsf();
    }

#ifdef CONFIG_RTC_HIRES
  /* Enable overflow interrupt - alarm interrupt is enabled in
   * gd32_rtc_setalarm().
   */

  modifyreg32(GD32_RTC_INTEN, 0, RTC_INTEN_OVIE);
#endif

#ifdef CONFIG_RTC_ALARM
  /* Clear stale alarm state from cold boot (counter=alarm=0 match) or
   * warm restart (previous session residual).  Disable ALRMIE and clear
   * ALRMIF so that the first gd32_rtc_setalarm() call starts clean.
   */

  modifyreg32(GD32_RTC_INTEN, RTC_INTEN_ALRMIE, 0);
  putreg32(RTC_CTL_RSYNF, GD32_RTC_CTL);
#endif

  g_rtc_enabled = true;

  /* Disable write access to the backup domain
   * (RTC registers, RTC backup data registers and backup SRAM).
   */

  gd32_rtc_bkp_write_disable();

  return OK;
}

/****************************************************************************
 * Name: gd32_rtc_irqinitialize
 *
 * Description:
 *   Initialize IRQs for RTC, not possible during up_rtc_initialize because
 *   up_irqinitialize is called later.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

int gd32_rtc_irqinitialize(void)
{
#if defined(CONFIG_RTC_HIRES) || defined(CONFIG_RTC_ALARM)
  /* Configure RTC interrupt to catch overflow and alarm interrupts. */

    irq_attach(GD32_IRQ_RTC, gd32_rtc_interrupt, NULL);
    up_enable_irq(GD32_IRQ_RTC);
#endif

#ifdef CONFIG_RTC_ALARM
  /* Configure EXTI line 17 for RTC alarm interrupt.
   * Rising edge trigger, interrupt mode.
   */

  gd32_exti_alarm(true, false, false, gd32_rtc_interrupt, NULL);
#endif

  return OK;
}

/****************************************************************************
 * Name: up_rtc_time
 *
 * Description:
 *   Get the current time in seconds.
 *   This is similar to the standard time() function.
 *   This interface is only required if the low-resolution RTC/counter
 *   hardware implementation selected.  It is only used by the RTOS during
 *   initialization to set up the system time when CONFIG_RTC is set but
 *   neither CONFIG_RTC_HIRES nor CONFIG_RTC_DATETIME are set.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The current time in seconds
 *
 ****************************************************************************/

#ifndef CONFIG_RTC_HIRES
time_t up_rtc_time(void)
{
  irqstate_t flags;
  uint16_t cnth;
  uint16_t cntl;
  uint16_t tmp;

  /* The RTC counter is read from two 16-bit registers to form one 32-bit
   * value.  Because these are non-atomic operations, many things can happen
   * between the two reads:  This thread could get suspended or interrupted
   * or the lower 16-bit counter could rollover between reads.  Disabling
   * interrupts will prevent suspensions and interruptions:
   */

  flags = spin_lock_irqsave(&g_rtc_lock);

  /* And the following loop will handle any clock rollover events that may
   * happen between samples.  Most of the time (like 99.9%), the following
   * loop will execute only once.  In the rare rollover case, it should
   * execute no more than 2 times.
   */

  do
    {
      tmp  = (uint16_t)getreg32(GD32_RTC_CNTL);
      cnth = (uint16_t)getreg32(GD32_RTC_CNTH);
      cntl = (uint16_t)getreg32(GD32_RTC_CNTL);
    }

  /* The second sample of CNTL could be less than the first sample of CNTL
   * only if rollover occurred.  In that case, CNTH may or may not be out
   * of sync.  The best thing to do is try again until we know that no
   * rollover occurred.
   */

  while (cntl < tmp);
  spin_unlock_irqrestore(&g_rtc_lock, flags);

  /* Okay.. the samples should be as close together in time as possible and
   * we can be assured that no clock rollover occurred between the samples.
   *
   * Return the time in seconds.
   */

  return ((time_t)cnth << 16 | (time_t)cntl);
}
#endif

/****************************************************************************
 * Name: up_rtc_gettime
 *
 * Description:
 *   Get the current time from the high resolution RTC clock/counter.  This
 *   interface is only supported by the high-resolution RTC/counter hardware
 *   implementation.
 *   It is used to replace the system timer.
 *
 * Input Parameters:
 *   tp - The location to return the high resolution time value.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_HIRES
int up_rtc_gettime(struct timespec *tp)
{
  irqstate_t flags;
  uint32_t ls;
  uint32_t ms;
  uint16_t ovf;
  uint16_t cnth;
  uint16_t cntl;
  uint16_t tmp;

  /* The RTC counter is read from two 16-bit registers to form one 32-bit
   * value.  Because these are non-atomic operations, many things can happen
   * between the two reads:  This thread could get suspended or interrupted
   * or the lower 16-bit counter could rollover between reads.  Disabling
   * interrupts will prevent suspensions and interruptions:
   */

  flags = spin_lock_irqsave(&g_rtc_lock);

  /* And the following loop will handle any clock rollover events that may
   * happen between samples.  Most of the time (like 99.9%), the following
   * loop will execute only once.  In the rare rollover case, it should
   * execute no more than 2 times.
   */

  do
    {
      tmp  = (uint16_t)getreg32(GD32_RTC_CNTL);
      cnth = (uint16_t)getreg32(GD32_RTC_CNTH);
      ovf  = (uint16_t)getreg32(RTC_TIMEMSB_REG);
      cntl = (uint16_t)getreg32(GD32_RTC_CNTL);
    }

  /* The second sample of CNTL could be less than the first sample of CNTL
   * only if rollover occurred.  In that case, CNTH may or may not be out
   * of sync.  The best thing to do is try again until we know that no
   * rollover occurred.
   */

  while (cntl < tmp);
  spin_unlock_irqrestore(&g_rtc_lock, flags);

  /* Okay.. the samples should be as close together in time as possible and
   * we can be assured that no clock rollover occurred between the samples.
   *
   * Create a 32-bit value from the LS and MS 16-bit RTC counter values and
   * from the MS and overflow 16-bit counter values.
   */

  ls = (uint32_t)cnth << 16 | (uint32_t)cntl;
  ms = (uint32_t)ovf  << 16 | (uint32_t)cnth;

