GD32-MCU-IOT/gd32_nuttx/arch/arm/src/gd32e11x/gd32e11x_rtcounter.c
  /* Then we can save the time in seconds and fractional seconds. */

  tp->tv_sec  = (ms << (32 - RTC_CLOCKS_SHIFT - 16)) |
                (ls >> (RTC_CLOCKS_SHIFT + 16));
  tp->tv_nsec = (ls & (CONFIG_RTC_FREQUENCY - 1)) *
                (1000000000 / CONFIG_RTC_FREQUENCY);
  return OK;
}
#endif

/****************************************************************************
 * Name: up_rtc_settime
 *
 * Description:
 *   Set the RTC to the provided time.  All RTC implementations must be able
 *   to set their time based on a standard timespec.
 *
 * Input Parameters:
 *   tp - the time to use
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

int up_rtc_settime(const struct timespec *tp)
{
  struct rtc_regvals_s regvals;
  irqstate_t flags;

  /* Break out the time values */

  gd32_rtc_breakout(tp, &regvals);

  /* Enable write access to the backup domain */

  flags = spin_lock_irqsave(&g_rtc_lock);
  gd32_rtc_bkp_write_enable();

  /* Then write the broken out values to the RTC counter and BKP overflow
   * register (hi-res mode only)
   */

  gd32_rtc_beginwr();
  putreg32(regvals.cnth, GD32_RTC_CNTH);
  putreg32(regvals.cntl, GD32_RTC_CNTL);
  gd32_rtc_endwr();
  putreg32(RTC_MAGIC_TIME_SET, RTC_MAGIC_REG);

#ifdef CONFIG_RTC_HIRES
  putreg32(regvals.ovf, RTC_TIMEMSB_REG);
#endif

  gd32_rtc_bkp_write_disable();
  spin_unlock_irqrestore(&g_rtc_lock, flags);
  return OK;
}

/****************************************************************************
 * Name: gd32_rtc_setalarm
 *
 * Description:
 *   Set up an alarm.
 *
 * Input Parameters:
 *   tp - the time to set the alarm
 *   callback - the function to call when the alarm expires.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_ALARM
int gd32_rtc_setalarm(const struct timespec *tp, alarmcb_t callback)
{
  struct rtc_regvals_s regvals;
  irqstate_t flags;
  uint16_t cr;
  int ret = -EBUSY;

  flags = spin_lock_irqsave(&g_rtc_lock);

  /* Is there already something waiting on the ALARM? */

  if (g_alarmcb == NULL)
    {
      /* No.. Save the callback function pointer */

      g_alarmcb = callback;

      /* Break out the time values */

      gd32_rtc_breakout(tp, &regvals);

      gd32_rtc_bkp_write_enable();

      /* Clear any stale alarm flag before enabling, then enable alarm */

      putreg32(RTC_CTL_RSYNF, GD32_RTC_CTL);
      cr  = getreg32(GD32_RTC_INTEN);
      cr |= RTC_INTEN_ALRMIE;
      putreg32(cr, GD32_RTC_INTEN);

      /* The set the alarm */

      gd32_rtc_beginwr();
      putreg32(regvals.cnth, GD32_RTC_ALRMH);
      putreg32(regvals.cntl, GD32_RTC_ALRML);
      gd32_rtc_endwr();

      /* Cache alarm value — ALRMH/ALRML are write-only registers */

      g_alarm_cnth = regvals.cnth;
      g_alarm_cntl = regvals.cntl;

      gd32_rtc_bkp_write_disable();

      ret = OK;
    }

  spin_unlock_irqrestore(&g_rtc_lock, flags);

  return ret;
}
#endif

/****************************************************************************
 * Name: gd32_rtc_cancelalarm
 *
 * Description:
 *   Cancel a pending alarm alarm
 *
 * Input Parameters:
 *   none
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_ALARM
int gd32_rtc_cancelalarm(void)
{
  irqstate_t flags;
  int ret = -ENODATA;

  flags = spin_lock_irqsave(&g_rtc_lock);

  if (g_alarmcb != NULL)
    {
      /* Cancel the global callback function */

      g_alarmcb = NULL;

      /* Disable alarm interrupt and unset the alarm */

      gd32_rtc_bkp_write_enable();
      modifyreg32(GD32_RTC_INTEN, RTC_INTEN_ALRMIE, 0);
      gd32_rtc_beginwr();
      putreg32(0xffff, GD32_RTC_ALRMH);
      putreg32(0xffff, GD32_RTC_ALRML);
      gd32_rtc_endwr();
      putreg32(RTC_CTL_RSYNF, GD32_RTC_CTL);
      gd32_rtc_bkp_write_disable();

      ret = OK;
    }

  spin_unlock_irqrestore(&g_rtc_lock, flags);

  return ret;
}
#endif

/****************************************************************************
 * Name: gd32_rtc_rdalarm
 *
 * Description:
 *   Query an alarm configured in hardware.
 *
 * Input Parameters:
 *  alminfo - Information about the alarm configuration.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_ALARM
int gd32_rtc_rdalarm(FAR struct alm_rdalarm_s *alminfo)
{
  struct timespec tp;
  int ret = -EINVAL;

  DEBUGASSERT(alminfo != NULL);
  DEBUGASSERT(alminfo->ar_id == 0);

  switch (alminfo->ar_id)
    {
      case 0:
        {
          struct tm tmp;

          /* Use cached values — ALRMH/ALRML are write-only registers,
           * reading them returns undefined data.
           */

          tp.tv_sec = (time_t)g_alarm_cnth << 16 | g_alarm_cntl;
          gmtime_r(&tp.tv_sec, &tmp);
          memcpy(alminfo->ar_time, &tmp, sizeof(struct tm));
          ret = OK;
        }
        break;

      default:
        rtcerr("ERROR: Invalid ALARM%d\n", alminfo->ar_id);
        break;
    }

  return ret;
}
#endif